[
  {
    "recruiter_name": "ARISTIDE N.",
    "recruiter_location": "Alexandria, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/aristide-n-766390103?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABo38T4BlYSBPMqhyPYRvw2fbSoM91fKiXo",
    "recruiter_about": "Experienced Recruiter with over 7 years of experience in the field of Information Technology (IT). Involved in hunting and 5 years performing full lifecycle recruiting with a heavy focus around sourcing, intake calls, screening, and scheduling interviews as well as keeping candidates involved through a recruiting process. I have a great passion for learning and deep understanding of software development and operations as well as Devops culturesExperienced Recruiter with over 7 years of experience in the field of Information Technology (IT). Involved in hunting and 5 years performing full lifecycle recruiting with a heavy focus around sourcing, intake calls, screening, and scheduling interviews as well as keeping candidates involved through a recruiting process. I have a great passion for learning and deep understanding of software development and operations as well as Devops cultures",
    "recruiter_education": "undefined",
    "recruiter_experience": "Senior Technical Recruiter at Saisystems Technology",
    "recruiter_tagline": "Recruiter with coding expertise, comprehensive understanding of software development lifecycle, cloud computing, and cybersecurity. Strong communication skills, coupled with a discerning sense of fashion.",
    "recruiter_status": "Current: Senior Technical Recruiter at Saisystems Technology",
    "search_query": "Software Development"
  },
  {
    "recruiter_name": "Jaya Telugunti",
    "recruiter_location": "Herndon, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/jayatelugunti?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACvlucABK4ykSqvKsJQ_9JyTmW_-AoELltI",
    "recruiter_about": "Got 5+ years of experience in HR and Recruitment roles with hands on experience in placing candidates as well as finding candidates for clients/vendors in various technologies/areas like .NET, Java, Testing, Business and Project Management etc. Also experienced in placing candidates for Staffing agencies and as part of Bench sales, identifying and placing the right candidates by providing required training, search jobs and submitting the profiles by making changes as needed to their resumes.Highly organized in maintaining the relationship with vendors, clients and candidates for ongoing and future requirements.Got 5+ years of experience in HR and Recruitment roles with hands on experience in placing candidates as well as finding candidates for clients/vendors in various technologies/areas like .NET, Java, Testing, Business and Project Management etc. \n\nAlso experienced in placing candidates for Staffing agencies and as part of Bench sales, identifying and placing the right candidates by providing required training, search jobs and submitting the profiles by making changes as needed to their resumes.\n\nHighly organized in maintaining the relationship with vendors, clients and candidates for ongoing and future requirements.",
    "recruiter_education": "undefined",
    "recruiter_experience": "Senior Technical Recruiter at Dia Software Solutions · Full-time",
    "recruiter_tagline": "Sr Technical Recruiter at Dia Software Solutions",
    "recruiter_status": "Current: Senior Technical Recruiter at Dia Software Solutions",
    "search_query": "Software Development"
  },
  {
    "recruiter_name": "Kate Suhorovska",
    "recruiter_location": "Lindenhurst, NY",
    "recruiter_linkedin": "https://www.linkedin.com/in/kate-suhorovska-839391201?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADN92G0BR5LdLSLK7hfeJtxMM8T74e1PcwQ",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Recruiter at Incora Software Development Company · Full-time",
    "recruiter_tagline": "Recruiter at Incora Software Development Company",
    "recruiter_status": "Current: Recruiter at Incora Software Development Company",
    "search_query": "Software Development"
  },
  {
    "recruiter_name": "Juliana Thurman",
    "recruiter_location": "Woodbridge, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/juliana-thurman-a4a344191?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAC0UGNoBu4e_Sj8xWjeNzuH7v2Zkl9eGOEk",
    "recruiter_about": "With over seven years of experience in human resources, I am a skilled and versatile professional who can thrive in different industries and roles. I have a Bachelor of Business Administration degree and a solid background in relationship building. As a Talent Acquisition Specialist at Dell Technologies, I contributed to finding, attracting, and hiring the best talent for one of the world's leading information technology and services companies. I demonstrated agility, independent thinking, interpersonal relationships, public speaking, and organization skills. I was passionate about creating a positive and inclusive candidate experience, building strong relationships with internal and external stakeholders, and supporting the company's vision and values. Most recently, I worked as a Customer Service Specialist at Burke Healthcare Solutions, where I applied my HR skills to handle customer inquiries, complaints, and feedback. I also helped with event planning, skill development, and quality assurance. I gained valuable experience in the healthcare industry and enhanced my attention to detail, communication, and problem-solving skills. I am currently looking for a new opportunity in the human resources field, where I can leverage my diverse and relevant experience, skills, and credentials to make a positive impact on the organization and the people I work with.With over seven years of experience in human resources, I am a skilled and versatile professional who can thrive in different industries and roles. I have a Bachelor of Business Administration degree and a solid background in relationship building. \n\nAs a Talent Acquisition Specialist at Dell Technologies, I contributed to finding, attracting, and hiring the best talent for one of the world's leading information technology and services companies. I demonstrated agility, independent thinking, interpersonal relationships, public speaking, and organization skills. I was passionate about creating a positive and inclusive candidate experience, building strong relationships with internal and external stakeholders, and supporting the company's vision and values. \n\nMost recently, I worked as a Customer Service Specialist at Burke Healthcare Solutions, where I applied my HR skills to handle customer inquiries, complaints, and feedback. I also helped with event planning, skill development, and quality assurance. I gained valuable experience in the healthcare industry and enhanced my attention to detail, communication, and problem-solving skills. \n\nI am currently looking for a new opportunity in the human resources field, where I can leverage my diverse and relevant experience, skills, and credentials to make a positive impact on the organization and the people I work with.",
    "recruiter_education": "Report Writing",
    "recruiter_experience": "Recruiter at Asurion · Full-time",
    "recruiter_tagline": "Recruiter and Talent Management",
    "recruiter_status": "Current: Recruiter at Asurion",
    "search_query": "Software Development"
  },
  {
    "recruiter_name": "Carolina P.",
    "recruiter_location": "San Francisco, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/carolinabarreto1015?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADd_w8EBULePes7TcYNwvRejVeuUc-oLNjI",
    "recruiter_about": "Loving what I do and where I get to do it! I've been at Meta, formerly Facebook, almost 9 years (pinch me!) and it has been the most fulfilling career. I love working with university students! Connecting with them one-on-one, sharing resume tips, and guiding them through the interview process fills my tank. I pride myself on candidate care, moving fast and getting back to candidates in a timely manner, and being extremely organized.My experience as a first-generation student has shaped who I am and makes me a huge advocate for diversity and inclusion, especially in tech. I am first-generation Latina and the first in my family to graduate from high school and college.Interested in what we do at Meta? We give people the power to build community and bring the world closer together. Join Meta and our growing family of apps/services (e.g. Instagram, Oculus, WhatsApp, Messenger, Threads, Novi). We're moving fast, making an impact, and just getting started!Looking forward to connecting with you!Loving what I do and where I get to do it! I've been at Meta, formerly Facebook, almost 9 years (pinch me!) and it has been the most fulfilling career. I love working with university students! Connecting with them one-on-one, sharing resume tips, and guiding them through the interview process fills my tank. I pride myself on candidate care, moving fast and getting back to candidates in a timely manner, and being extremely organized.\n\nMy experience as a first-generation student has shaped who I am and makes me a huge advocate for diversity and inclusion, especially in tech. I am first-generation Latina and the first in my family to graduate from high school and college.\n\nInterested in what we do at Meta? We give people the power to build community and bring the world closer together. Join Meta and our growing family of apps/services (e.g. Instagram, Oculus, WhatsApp, Messenger, Threads, Novi). We're moving fast, making an impact, and just getting started!\n\nLooking forward to connecting with you!",
    "recruiter_education": "University of the Pacific",
    "recruiter_experience": "University Recruiter at Meta",
    "recruiter_tagline": "University Recruiter at Meta (Data Science / SWE)",
    "recruiter_status": "Current: University Recruiter at Meta",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Sophie Bishop",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/sophie-bishop-410b113b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAiHjgwBeTP0cpdwZGNSSWf_jddUxZ2ag0k",
    "recruiter_about": "Consult and partner with senior leadership to identify hiring needs, build recruitment strategies, and recommend candidatesPre-screen candidates to determine knowledge and skill set compared to the position requirements and scope, evaluate candidate fit, and recommend candidates to hiring managersPrepare candidates for onsite panel interviews and work with them through the offer processConsult and partner with senior leadership to identify hiring needs, build recruitment strategies, and recommend candidates\n\nPre-screen candidates to determine knowledge and skill set compared to the position requirements and scope, evaluate candidate fit, and recommend candidates to hiring managers\n\nPrepare candidates for onsite panel interviews and work with them through the offer process",
    "recruiter_education": "Virginia Tech",
    "recruiter_experience": "Senior Recruiter at Visa",
    "recruiter_tagline": "Senior Recruiter - Hiring for Visa Consulting and Analytics and Global Data Science @ Visa",
    "recruiter_status": "Current: Senior Recruiter at Visa",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Sanju Kumari",
    "recruiter_location": "Chester Springs, PA",
    "recruiter_linkedin": "https://www.linkedin.com/in/sanjukumari?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADOWi8UBT88EFlmAJ0VRWFArwE1bWvyGBhg",
    "recruiter_about": "Amazon Web Services (AWS) is one of the most dynamic and fastest growing businessesof Amazon. Since 2006, AWS has provided companies of all sizes with cloud technologyproducts & solutions and access to a global computing infrastructure that is thebackbone of Amazon’s multi-billion dollar retail business. Today, AWS powers hundredsof thousands of businesses in 190 countries around the world. Come build the future ofcloud computing with us: https://aws.amazon.com/careers/https://youtu.be/6zdmitPQg8kAmazon Web Services (AWS) is one of the most dynamic and fastest growing businesses\nof Amazon. Since 2006, AWS has provided companies of all sizes with cloud technology\nproducts & solutions and access to a global computing infrastructure that is the\nbackbone of Amazon’s multi-billion dollar retail business. Today, AWS powers hundreds\nof thousands of businesses in 190 countries around the world. Come build the future of\ncloud computing with us: https://aws.amazon.com/careers/\n\nhttps://youtu.be/6zdmitPQg8k",
    "recruiter_education": "AWS Certified Cloud Practitioner",
    "recruiter_experience": "Recruiter (via Populus Group) at Amazon Web Services (AWS) · Contract",
    "recruiter_tagline": "Recruiter @ Amazon Web Services (AWS) | Hiring Controls Engineers/Managers for AWS Data Centers",
    "recruiter_status": "Current: Recruiter (via Populus Group) at Amazon Web Services (AWS)",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Carolyn Karbel",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/carolynkarbel?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAANYbOUBrm09ywcLeg8FgOGRAplZn2hv7OQ",
    "recruiter_about": "Experienced Talent Acquisition professional with a demonstrated history of successfully recruiting within the technology, media, consulting, and international development industries. Skilled in sourcing and identifying rare top talent that both meets job requirements and will add to a company’s culture.  Love building relationships with candidates and hiring managers to both build strong teams and help candidates gain their new job!Experienced Talent Acquisition professional with a demonstrated history of successfully recruiting within the technology, media, consulting, and international development industries. Skilled in sourcing and identifying rare top talent that both meets job requirements and will add to a company’s culture.  Love building relationships with candidates and hiring managers to both build strong teams and help candidates gain their new job!",
    "recruiter_education": "Recruiting",
    "recruiter_experience": "Principal Recruiter - Product Management at Capital One",
    "recruiter_tagline": "Principal Recruiter - Product Management at Capital One",
    "recruiter_status": "Current: Senior Recruiter - Data Science at Capital One",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "George Rodriguez",
    "recruiter_location": "Redwood City, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/georgerodriguezz?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAKXNwBGZep7GwRm8BOmWSTLqdzDQEa3o4",
    "recruiter_about": "Global Practice Recruiter - Data & Decision Science - Digital Surgery / Medical Devices / AI / Robotics / Data ScienceHyper-growth company-wide, please reach out and lets discuss the opportunitiesGlobal Practice Recruiter - Data & Decision Science - Digital Surgery / Medical Devices / AI / Robotics / Data Science\n\nHyper-growth company-wide, please reach out and lets discuss the opportunities",
    "recruiter_education": "University of Phoenix",
    "recruiter_experience": "Sr. Global Practice Recruiter - Decision & Data Science at Johnson & Johnson",
    "recruiter_tagline": "Global Practice Recruiter - Data & Decision Science at Johnson & Johnson",
    "recruiter_status": "Current: Sr. Global Practice Recruiter - Decision & Data Science at Johnson & Johnson",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Angelina Renteria",
    "recruiter_location": "Santa Clara, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/angelinarenteria?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAEADJMBSP4eGCOKIUH-t2Pv5ppTGhJU1vc",
    "recruiter_about": "With over twenty years of experience in full life-cycle Technical Recruiting, I have successfully supported staffing projects for renowned companies such as Apple and Samsung. In 2018, I transitioned from the agency world to corporate recruiting, specializing in Robotics, Software, Hardware, and Electrical Engineering roles for a cutting-edge MedTech Robotics System Start Up.Working closely with my Recruiting Director, we achieved substantial growth, doubling the company's size from 250 to over 500 employees, with minimal reliance on external agencies. In 2020, Johnson & Johnson acquired my company, and I transitioned to the Data Science Recruiting team as the sole Sourcer. Building strong relationships with business stakeholders, I attracted top Data Science talent to the company. As a result, I was subsequently promoted to a Talent Acquisition Partner role, continuing to collaborate with key business leaders.Currently, as a member of the Data Science Talent team, I partner with Commercial Leaders in recruiting for various AI & Data Science Product strategy and development roles. Additionally, I work closely with the AI & Data Science teams contributing to the growth and success of our MedTech products.Specialties:- Proficient in targeted sourcing techniques, including Boolean Search Strings, X-Ray Searches, GIT, and Social Media Sourcing.- Utilize sourcing tools such as Seekout and LinkedIn Recruiter, as well as HRIS systems like Taleo, Newton, Workday, and Hiredscore.- Extensive experience in Recruiting & Networking, with a proven track record in negotiation and relationship building.- National and international recruiting experience, with particular expertise in Data Science & Robotics roles within the Commercial Pharmaceutical and MedTech R&D sectors.With my diverse skill set and in-depth understanding of the industry, I am committed to identifying top talent and strategically driving the growth of organizations in the rapidly evolving technology landscape.With over twenty years of experience in full life-cycle Technical Recruiting, I have successfully supported staffing projects for renowned companies such as Apple and Samsung. In 2018, I transitioned from the agency world to corporate recruiting, specializing in Robotics, Software, Hardware, and Electrical Engineering roles for a cutting-edge MedTech Robotics System Start Up.\n\nWorking closely with my Recruiting Director, we achieved substantial growth, doubling the company's size from 250 to over 500 employees, with minimal reliance on external agencies. In 2020, Johnson & Johnson acquired my company, and I transitioned to the Data Science Recruiting team as the sole Sourcer. Building strong relationships with business stakeholders, I attracted top Data Science talent to the company. As a result, I was subsequently promoted to a Talent Acquisition Partner role, continuing to collaborate with key business leaders.\n\nCurrently, as a member of the Data Science Talent team, I partner with Commercial Leaders in recruiting for various AI & Data Science Product strategy and development roles. Additionally, I work closely with the AI & Data Science teams contributing to the growth and success of our MedTech products.\n\nSpecialties:\n- Proficient in targeted sourcing techniques, including Boolean Search Strings, X-Ray Searches, GIT, and Social Media Sourcing.\n- Utilize sourcing tools such as Seekout and LinkedIn Recruiter, as well as HRIS systems like Taleo, Newton, Workday, and Hiredscore.\n- Extensive experience in Recruiting & Networking, with a proven track record in negotiation and relationship building.\n- National and international recruiting experience, with particular expertise in Data Science & Robotics roles within the Commercial Pharmaceutical and MedTech R&D sectors.\n\nWith my diverse skill set and in-depth understanding of the industry, I am committed to identifying top talent and strategically driving the growth of organizations in the rapidly evolving technology landscape.",
    "recruiter_education": "Gunderson High School",
    "recruiter_experience": "Global Practice Recruiter - Data Science  at Johnson & Johnson",
    "recruiter_tagline": "Global Practice Recruiter focused on Data Science in Commercial Pharmaceutical & Medtech!",
    "recruiter_status": "Current: Global Practice Recruiter - Data Science at Johnson & Johnson",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Evan Delfin, MHRIR",
    "recruiter_location": "McLean, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/evan-delfin-mhrir-55ba23114?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABygsVcBGtLVO1OBG7KHPg77U_no4Gu57bg",
    "recruiter_about": "undefined",
    "recruiter_education": "Tableau Analyst",
    "recruiter_experience": "Associate Recruiter at Capital One",
    "recruiter_tagline": "Associate Data Science Recruiter @ Capital One | HR, Recruitment",
    "recruiter_status": "Current: Associate Recruiter at Capital One",
    "search_query": "Data Science"
  },
  {
    "recruiter_name": "Smitha N.",
    "recruiter_location": "Dublin, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/smitha-n-0a227a122?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAB5LsvoBiDdU1sl_FT6o9aT3S8DLxCXQXSs",
    "recruiter_about": "An astute talent acquisition professional with overall 6+ years of experience in both IT, Security Space & Engineering scouting the best talent for contract and full-time roles. Experience in managing all phases of recruitment, from initial sourcing and screening through offer negotiations, placement and on-boarding. - Expert in Sourcing , Screening , Identifying , Scheduling , Evaluating.-Proficiency in using LinkedIn Recruiter, Beamery, Hiretual, Jobvite, entelo, seekout.- ATS (iCIMS / Workable)- Full Cycle Recruiter- Qualitative and Quantitative Recruiting.-Hands on Experience with office tools.- Excellent Interpersonal SkillsAn astute talent acquisition professional with overall 6+ years of experience in both IT, Security Space & Engineering scouting the best talent for contract and full-time roles. Experience in managing all phases of recruitment, from initial sourcing and screening through offer negotiations, placement and on-boarding. \n\n- Expert in Sourcing , Screening , Identifying , Scheduling , Evaluating.\n-Proficiency in using LinkedIn Recruiter, Beamery, Hiretual, Jobvite, entelo, seekout.\n- ATS (iCIMS / Workable)\n- Full Cycle Recruiter\n- Qualitative and Quantitative Recruiting.\n-Hands on Experience with office tools.\n- Excellent Interpersonal Skills",
    "recruiter_education": "Amazon",
    "recruiter_experience": "Technical Recruiter at Amazon",
    "recruiter_tagline": "Technical Recruiter |Specialized in SDE, Machine Learning & AI Talent |Amazon",
    "recruiter_status": "Current: Technical Recruiter at Amazon",
    "search_query": "Machine Learning"
  },
  {
    "recruiter_name": "Madison G.",
    "recruiter_location": "San Diego, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/madisong5440?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAEAgvW8BJ2L2j-pmFcqw8RwgZW3cDeTG5M8",
    "recruiter_about": "I am a Technical Recruiter for Lorien. I specialize in building out an AI/ML pipeline and placing them in a job that matches their motivations and long-term goals.I am a Technical Recruiter for Lorien. I specialize in building out an AI/ML pipeline and placing them in a job that matches their motivations and long-term goals.",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter at Lorien · Full-time",
    "recruiter_tagline": "Technical Recruiter @ Lorien | AI Development, Machine Learning",
    "recruiter_status": "Current: Technical Recruiter at Lorien",
    "search_query": "Machine Learning"
  },
  {
    "recruiter_name": "Wendy Lopez",
    "recruiter_location": "Arlington, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/wendy-lopez?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAATioI8Bc1qsYqNqb23MHM2w9yohXkl19E0",
    "recruiter_about": "Recruiting experienced Software Engineers for Google across North America.Recruiting experienced Software Engineers for Google across North America.",
    "recruiter_education": "Marymount University",
    "recruiter_experience": "Principal Technical Recruiter, Software Engineering at Meta · Full-time",
    "recruiter_tagline": "Software Engineering Recruiter @ Meta | Machine Learning & Extended Reality",
    "recruiter_status": "Current: Principal Technical Recruiter, Software Engineering at Meta",
    "search_query": "Machine Learning"
  },
  {
    "recruiter_name": "George B.",
    "recruiter_location": "San Jose, CA",
    "recruiter_linkedin": "https://www.linkedin.com/in/george-b-8ba82953?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAtVs84BAtXEVF6zJlwULri2P7suUC1uxxk",
    "recruiter_about": "I have spent my career searching for creative ways to locate and engage with candidates, while partnering with clients to find the right talent for their teams.  I have a strong  passion for mentoring, development and sourcing,  where I focus on platforms and techniques outside of the norm.I have spent my career searching for creative ways to locate and engage with candidates, while partnering with clients to find the right talent for their teams.  I have a strong  passion for mentoring, development and sourcing,  where I focus on platforms and techniques outside of the norm.",
    "recruiter_education": "Pacific Union College",
    "recruiter_experience": "Senior Technical Recruiter - AI & Machine Learning Team - AIML at Apple · Full-time",
    "recruiter_tagline": "Artificial Intelligence & Machine Learning @ Apple",
    "recruiter_status": "Current: Senior Technical Recruiter - AI & Machine Learning Team - AIML at Apple",
    "search_query": "Machine Learning"
  },
  {
    "recruiter_name": "Frazer Spackman",
    "recruiter_location": "Boston, MA",
    "recruiter_linkedin": "https://www.linkedin.com/in/frazer-spackman?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAMpW-IBapV0Jc5dTBo_B-Avs6sqer0X4Os",
    "recruiter_about": "14+ years of recruitment and search experience. Oversee Huxley's COE for AI/ML Search. In my role as Director of Talent & Development at Altana AI, I was responsible for hiring, onboarding, culture and performance management processes.14+ years of recruitment and search experience. Oversee Huxley's COE for AI/ML Search. In my role as Director of Talent & Development at Altana AI, I was responsible for hiring, onboarding, culture and performance management processes.",
    "recruiter_education": "Data Engineering",
    "recruiter_experience": "Executive Technical Recruiter - Machine Learning & Data at Huxley · Full-time",
    "recruiter_tagline": "Executive Technical Recruiter - Machine Learning & Data",
    "recruiter_status": "Current: Executive Technical Recruiter - Machine Learning & Data at Huxley",
    "search_query": "Machine Learning"
  },
  {
    "recruiter_name": "Brett Besecky",
    "recruiter_location": "New York, NY",
    "recruiter_linkedin": "https://www.linkedin.com/in/brettbesecky?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACU5NmQBa6USu0w8L_tgqfZgJy4PSm4PvHA",
    "recruiter_about": "Brett has been with Amazon Talent Acquisition (TA) for over two years, starting as a Recruiter I (L4) supporting Alexa and Software Test Teams (QAEs/SDETs). Before Amazon, he was a top-performing agency recruiter, managing full-life cycle recruiting for roles ranging from high volume positions to cybersecurity, software engineers, and director and C-suite roles.Brett has demonstrated a deep understanding of Amazon's processes by improving sourcing and process efficiency. Despite being a “sourcing recruiter,” he has embraced full life cycle responsibilities, creating offers and taking ownership of negotiation, presentation, offer extension, and onboarding processes, optimizing team efficacy and hiring speed.Brett’s expertise in operational excellence and project management allows him to develop and execute sourcing strategies independently. He played a crucial role in planning and executing the AGI pilot program’s TA deliverables as well as completing a Master’s Degree in Project Management with a specialization in Strategic Innovation and Change Management, maintaining a 4.0 GPA.Brett’s work is strategic, managing high volume and hard-to-fill roles for various Amazon teams, including AGI, Consumer Robotics, eero, DOSTA, Amazon Games (Luna), and Amazon Appstore. He partners with hiring managers to understand the candidate market, educate them on best hiring practices, and create lasting relationships. He identifies and mitigates risks early on and brings quality, speed, and quantity to ensure the best candidates are hired.Brett is dedicated to mentoring and supporting his peers, leading recruitment educational sessions, and volunteering to help whenever needed. He has become an SME in the software quality space, handling roles from L2 to L6 for Software Test Team roles, Quality Assurance Engineers, and Software Development Engineers in Test. His customer obsession, ability to earn trust, and deliver results make him highly sought after by hiring managers.Brett excels in candidate generation. Brett’s meticulous attention to detail, effective use of LinkedIn, and positive candidate experiences have made him an invaluable asset to Amazon.Brett significantly influenced international teams, including India TA, Quality Services Test teams in India, and TA teams in Costa Rica and EMEA. He led India’s 2&5 Promise project, helping Team Krithi exceed their goal, and championed the International Cultural Committee, fostering unity across global teams.Brett has been with Amazon Talent Acquisition (TA) for over two years, starting as a Recruiter I (L4) supporting Alexa and Software Test Teams (QAEs/SDETs). Before Amazon, he was a top-performing agency recruiter, managing full-life cycle recruiting for roles ranging from high volume positions to cybersecurity, software engineers, and director and C-suite roles.\n\nBrett has demonstrated a deep understanding of Amazon's processes by improving sourcing and process efficiency. Despite being a “sourcing recruiter,” he has embraced full life cycle responsibilities, creating offers and taking ownership of negotiation, presentation, offer extension, and onboarding processes, optimizing team efficacy and hiring speed.\n\nBrett’s expertise in operational excellence and project management allows him to develop and execute sourcing strategies independently. He played a crucial role in planning and executing the AGI pilot program’s TA deliverables as well as completing a Master’s Degree in Project Management with a specialization in Strategic Innovation and Change Management, maintaining a 4.0 GPA.\n\nBrett’s work is strategic, managing high volume and hard-to-fill roles for various Amazon teams, including AGI, Consumer Robotics, eero, DOSTA, Amazon Games (Luna), and Amazon Appstore. He partners with hiring managers to understand the candidate market, educate them on best hiring practices, and create lasting relationships. He identifies and mitigates risks early on and brings quality, speed, and quantity to ensure the best candidates are hired.\n\nBrett is dedicated to mentoring and supporting his peers, leading recruitment educational sessions, and volunteering to help whenever needed. He has become an SME in the software quality space, handling roles from L2 to L6 for Software Test Team roles, Quality Assurance Engineers, and Software Development Engineers in Test. His customer obsession, ability to earn trust, and deliver results make him highly sought after by hiring managers.\n\nBrett excels in candidate generation. Brett’s meticulous attention to detail, effective use of LinkedIn, and positive candidate experiences have made him an invaluable asset to Amazon.\n\nBrett significantly influenced international teams, including India TA, Quality Services Test teams in India, and TA teams in Costa Rica and EMEA. He led India’s 2&5 Promise project, helping Team Krithi exceed their goal, and championed the International Cultural Committee, fostering unity across global teams.",
    "recruiter_education": "Colorado State University Global",
    "recruiter_experience": "AGI Recruiter | Artificial General Intelligence at Amazon",
    "recruiter_tagline": "AGI Recruiter | Artificial General Intelligence @ Amazon | Master's in Project Management",
    "recruiter_status": "Current: AGI Recruiter | Artificial General Intelligence at Amazon",
    "search_query": "Artificial Intelligence"
  },
  {
    "recruiter_name": "Rachel Hamer",
    "recruiter_location": "United States",
    "recruiter_linkedin": "https://www.linkedin.com/in/rachel-hamer?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABBItLwBCM0R3R2M8eV6sIL03dO4kSQxiJU",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Senior Technical Recruiter at Amazon",
    "recruiter_tagline": "Sr Tech Recruiter - Amazon Artificial General Intelligence (AGI)",
    "recruiter_status": "Current: Senior Technical Recruiter at Amazon",
    "search_query": "Artificial Intelligence"
  },
  {
    "recruiter_name": "Vivek Kumar Rai",
    "recruiter_location": "Parsippany, NJ",
    "recruiter_linkedin": "https://www.linkedin.com/in/vivek-kumar-rai-917a971b1?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADF11WMBOKvhJihDtc6S6bBZ-D7WRvQ8_MI",
    "recruiter_about": "As a Technical Recruiter at Pinnacle, I am passionate about connecting talented professionals with the best opportunities in the Pharma/ Healthcare/Light industry. I have 2+ years of experience in talent acquisition, sourcing, screening, interviewing, and hiring candidates for various technical roles. I also have a B. Pharma degree from MPGI Kanpur, which gives me an edge in understanding the requirements and expectations of the clients and candidates in the healthcare and pharmaceutical sectors. I have strong skills in team leadership, problem solving, and recruiting, and I enjoy working with a diverse and collaborative team of recruiters, account managers, and clients. My goal is to provide excellent service and value to both the candidates and the clients, and to help them achieve their career and business objectivesAs a Technical Recruiter at Pinnacle, I am passionate about connecting talented professionals with the best opportunities in the Pharma/ Healthcare/Light industry. I have 2+ years of experience in talent acquisition, sourcing, screening, interviewing, and hiring candidates for various technical roles. I also have a B. Pharma degree from MPGI Kanpur, which gives me an edge in understanding the requirements and expectations of the clients and candidates in the healthcare and pharmaceutical sectors. I have strong skills in team leadership, problem solving, and recruiting, and I enjoy working with a diverse and collaborative team of recruiters, account managers, and clients. My goal is to provide excellent service and value to both the candidates and the clients, and to help them achieve their career and business objectives",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter at Pinnacle Technology · Full-time",
    "recruiter_tagline": "Pharma/Biotech Recruiter @Pinnacle Technology",
    "recruiter_status": "Current: Technical Recruiter at Pinnacle Technology",
    "search_query": "Artificial Intelligence"
  },
  {
    "recruiter_name": "Brandon Rockquemore",
    "recruiter_location": "Baltimore, MD",
    "recruiter_linkedin": "https://www.linkedin.com/in/brandon-rockquemore-b1ab40204?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADQjTkYB9NNDJ6qEW8IvdeH343s3Srz0W5o",
    "recruiter_about": "Passionate recruiter, looking to find the best talent and place them in the perfect roles. Looking to uncover people's passions, growth goals and help them transition to the next career step. And if they're not ready yet, I want to be the first line of communication to help them with career advancement.Passionate recruiter, looking to find the best talent and place them in the perfect roles. Looking to uncover people's passions, growth goals and help them transition to the next career step. And if they're not ready yet, I want to be the first line of communication to help them with career advancement.",
    "recruiter_education": "University of Miami School of Communication",
    "recruiter_experience": "Specialized Recruiter at TEKsystems",
    "recruiter_tagline": "Specialized Recruiter in Business Intelligence (Tableau/Power BI/SQL) at TEKsystems",
    "recruiter_status": "Current: Specialized Recruiter in Business Intelligence at TEKsystems",
    "search_query": "Artificial Intelligence"
  },
  {
    "recruiter_name": "Austin Gardner",
    "recruiter_location": "Alexandria, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/austin-gardner-4200?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABnIss8BJ4WA8yWkhYR-l8lRot8Zmuc2aGU",
    "recruiter_about": "- Staffs businesses by recruiting and evaluating job candidates- Recruits applicants by researching and contacting community services, colleges, employment agencies, recruiters, media, and internet sites- Determines applicant requirements by studying job description and job qualifications- Staffs businesses by recruiting and evaluating job candidates\n- Recruits applicants by researching and contacting community services, colleges, employment agencies, recruiters, media, and internet sites\n- Determines applicant requirements by studying job description and job qualifications",
    "recruiter_education": "Old Dominion University",
    "recruiter_experience": "Recruiter at Capital One · Full-time",
    "recruiter_tagline": "Business Analyst Students & Grads Recruiter at Capital One",
    "recruiter_status": "Current: Recruiter at Capital One",
    "search_query": "Artificial Intelligence"
  },
  {
    "recruiter_name": "Rafael Rangel Lopez",
    "recruiter_location": "Sellersville, PA",
    "recruiter_linkedin": "https://www.linkedin.com/in/rafael-rangel-lopez-769686209?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADT1jMEBX1eISuYC71XryQa20hxOgU9bKpw",
    "recruiter_about": "Hello! I’m Rafael, a Cybersecurity Analyst for FourCorners Cyber and a Recruiter for our partner company Symmetrio. I am passionate about cybersecurity, as it allows me to contribute to the effort of creating a more secure online environment for everyone. Additionally, my role as a recruiter lets me extend this enthusiasm by identifying exceptional individuals who share the same dedication as me. Outside of my professional pursuits, I enjoy traveling, exploring nature, playing tennis, and soccer.In these roles, I work closely with CISOs, Analysts, and Engineers from diverse companies in both the private and public sectors. My responsibilities include overseeing cybersecurity assessments, creating reports tailored for both technical and non-technical audiences, and identifying exceptional talent to meet our clients' needs.Through my work, my goal is to help companies succeed by spotting risks, designing solutions to reduce those risks and building strong teams to keep their digital information safe. My commitment is to make a lasting impact on the cybersecurity landscape, by fostering a safer and more resilient online world for everybody.Hello! I’m Rafael, a Cybersecurity Analyst for FourCorners Cyber and a Recruiter for our partner company Symmetrio. I am passionate about cybersecurity, as it allows me to contribute to the effort of creating a more secure online environment for everyone. Additionally, my role as a recruiter lets me extend this enthusiasm by identifying exceptional individuals who share the same dedication as me. Outside of my professional pursuits, I enjoy traveling, exploring nature, playing tennis, and soccer.\n\nIn these roles, I work closely with CISOs, Analysts, and Engineers from diverse companies in both the private and public sectors. My responsibilities include overseeing cybersecurity assessments, creating reports tailored for both technical and non-technical audiences, and identifying exceptional talent to meet our clients' needs.\n\nThrough my work, my goal is to help companies succeed by spotting risks, designing solutions to reduce those risks and building strong teams to keep their digital information safe. My commitment is to make a lasting impact on the cybersecurity landscape, by fostering a safer and more resilient online world for everybody.",
    "recruiter_education": "Penn State University",
    "recruiter_experience": "Cybersecurity Analyst | Recruiter at FourCorners Cyber · Full-time",
    "recruiter_tagline": "Cybersecurity Analyst | Recruiter at Symmetrio and FourCorners Cyber",
    "recruiter_status": "Current: Cybersecurity Analyst | Recruiter at FourCorners Cyber",
    "search_query": "Cybersecurity"
  },
  {
    "recruiter_name": "Joseph Thomssen",
    "recruiter_location": "Chicago, IL",
    "recruiter_linkedin": "https://www.linkedin.com/in/joseph-thomssen-9027171b3?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADHDCVIB2RuQTy_U7c5XJzkUEwJVxI65AMY",
    "recruiter_about": "I understand the importance of Cybersecurity and the impact it has on individuals and businesses alike. As someone who is passionate about this field, I empathize with the challenges that individuals face while pursuing their careers. As a Cybersecurity recruiter, my aim is to offer guidance and support to help individuals achieve their full potential and succeed in their careers. Let's work together towards a safer and secure digital world!Top 7% on TryHackMe en route to the top 1%Completed Evolve Cybersecurity BootcampSecurity+ If you are interested in building your security team or looking for a new opportunity within information security.Email: jthomssen@ninjajobs.orgRoles we have:  Sr. Security Researcher, Threat Researcher, Cloud Engineer(AWS,GCP, Azure), GRC Engineer, Principal Cyber Security Engineer, OT Cybersecurity Specialist, DLP Engineer and Director of Security Architecture We have new roles coming in all the time!I understand the importance of Cybersecurity and the impact it has on individuals and businesses alike. As someone who is passionate about this field, I empathize with the challenges that individuals face while pursuing their careers. As a Cybersecurity recruiter, my aim is to offer guidance and support to help individuals achieve their full potential and succeed in their careers. Let's work together towards a safer and secure digital world!\n\nTop 7% on TryHackMe en route to the top 1%\nCompleted Evolve Cybersecurity Bootcamp\nSecurity+ \n\nIf you are interested in building your security team or looking for a new opportunity within information security.\n\nEmail: jthomssen@ninjajobs.org\n\nRoles we have:  Sr. Security Researcher, Threat Researcher, Cloud Engineer(AWS,GCP, Azure), GRC Engineer, Principal Cyber Security Engineer, OT Cybersecurity Specialist, DLP Engineer and Director of Security Architecture \n\nWe have new roles coming in all the time!",
    "recruiter_education": "Evolve Security Academy",
    "recruiter_experience": "Senior Cybersecurity Recruiter  at NinjaJobs · Full-time",
    "recruiter_tagline": "Senior Cybersecurity Recruiter @ NinjaJobs | Security Researcher | Security+",
    "recruiter_status": "Current: Senior Cybersecurity Recruiter at NinjaJobs",
    "search_query": "Cybersecurity"
  },
  {
    "recruiter_name": "Shaun Poe",
    "recruiter_location": "Washington, DC",
    "recruiter_linkedin": "https://www.linkedin.com/in/shaun-poe?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAC8S5MQBubnttcNy5Ci1Y_590lBS67lnvEY",
    "recruiter_about": "undefined",
    "recruiter_education": "Sales Development",
    "recruiter_experience": "Technical Recruiter at NinjaJobs · Full-time",
    "recruiter_tagline": "Cybersecurity Recruiter at NinjaJobs",
    "recruiter_status": "Current: Technical Recruiter at NinjaJobs",
    "search_query": "Cybersecurity"
  },
  {
    "recruiter_name": "Carter Malkus",
    "recruiter_location": "Washington, DC",
    "recruiter_linkedin": "https://www.linkedin.com/in/carter-malkus-8ab644218?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADbpbAMBpRfbs-qAjDRoTKGf4v9fL2c0wow",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter at NinjaJobs · Full-time",
    "recruiter_tagline": "Cybersecurity Recruiter @ NinjaJobs",
    "recruiter_status": "Current: Technical Recruiter at NinjaJobs",
    "search_query": "Cybersecurity"
  },
  {
    "recruiter_name": "Amelia Isley",
    "recruiter_location": "Falls Church, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/amelia-isley?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACrRwAUB8DAHJOxB_0gEFtR4Lz9yfQuQyIw",
    "recruiter_about": "I graduated from Virginia Tech Pamplin College of Business with a BS in Marketing Management and a minor in Business Leadership in May of 2021. I was then a part of Apex Systems DC Federal team, working as a Technical Recruiter and later as an Account Manager specializing in Government Services. Now, I am working for XOR Security under Agile Defense as a Technical Recruiter specializing in Cybersecurity. I plan to continue to use the skills I have developed and will learn not only for my professional development but also to make a difference in others' lives by helping them succeed in their professional journey.At XOR Security, we build solutions that keep our citizens safe, our government’s information secure and our intelligence professionals one step ahead of the adversary. From cybersecurity and data analytics to strategic consulting and cloud services, the XOR team provides the insight, expertise, and dedication to ensure mission success.I graduated from Virginia Tech Pamplin College of Business with a BS in Marketing Management and a minor in Business Leadership in May of 2021. I was then a part of Apex Systems DC Federal team, working as a Technical Recruiter and later as an Account Manager specializing in Government Services. Now, I am working for XOR Security under Agile Defense as a Technical Recruiter specializing in Cybersecurity. I plan to continue to use the skills I have developed and will learn not only for my professional development but also to make a difference in others' lives by helping them succeed in their professional journey.\n\nAt XOR Security, we build solutions that keep our citizens safe, our government’s information secure and our intelligence professionals one step ahead of the adversary. From cybersecurity and data analytics to strategic consulting and cloud services, the XOR team provides the insight, expertise, and dedication to ensure mission success.",
    "recruiter_education": "Business Development",
    "recruiter_experience": "Technical Recruiter  at XOR Security · Full-time",
    "recruiter_tagline": "Technical Recruiter - Cybersecurity",
    "recruiter_status": "Current: Technical Recruiter at XOR Security",
    "search_query": "Cybersecurity"
  },
  {
    "recruiter_name": "Jason Long",
    "recruiter_location": "West Chester, PA",
    "recruiter_linkedin": "https://www.linkedin.com/in/jason-long-6327b0171?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACjf4oYBBSuNgL7tS53BXa5mGqtwXWtwtW4",
    "recruiter_about": "Actalent is committed to caring for you and your career. We want to be able to continuously align you with work that excites you and gives you what you’re looking for personally and professionally. We work with industry-leading companies to give you access to engineering and sciences opportunities where you can explore, learn, grow and prosper. Learn more about how we can work together at actalentservices.com.Actalent is committed to caring for you and your career. We want to be able to continuously align you with work that excites you and gives you what you’re looking for personally and professionally. We work with industry-leading companies to give you access to engineering and sciences opportunities where you can explore, learn, grow and prosper. Learn more about how we can work together at actalentservices.com.",
    "recruiter_education": "undefined",
    "recruiter_experience": "Engineering Recruiter at Actalent · Full-time",
    "recruiter_tagline": "Engineering Recruiter at Actalent",
    "recruiter_status": "Current: Engineering Recruiter at Aerotek",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Jennifer Kiarsis",
    "recruiter_location": "Washington, DC",
    "recruiter_linkedin": "https://www.linkedin.com/in/jennifer-kiarsis-a973b357?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAv7qVMBoSDq4eR41aycT03wubZi1kECgtI",
    "recruiter_about": "As a Senior Recruiter at MongoDB, I have been hiring for customer engineering roles for over four years, with a focus on pre-sales solutions consulting, technical services and professional services. I have a BA in Sociology with a concentration in Social Welfare and a minor in Gender Studies, as well as certifications in project management, service culture, and open data.I am skilled in creating and maintaining relationships with candidates, hiring managers, and stakeholders, as well as ensuring a smooth and positive hiring experience for everyone involved. I am detail-oriented, reliable, and responsible, and I always strive to deliver high-quality results and exceed expectations.As a Senior Recruiter at MongoDB, I have been hiring for customer engineering roles for over four years, with a focus on pre-sales solutions consulting, technical services and professional services. I have a BA in Sociology with a concentration in Social Welfare and a minor in Gender Studies, as well as certifications in project management, service culture, and open data.\n\nI am skilled in creating and maintaining relationships with candidates, hiring managers, and stakeholders, as well as ensuring a smooth and positive hiring experience for everyone involved. I am detail-oriented, reliable, and responsible, and I always strive to deliver high-quality results and exceed expectations.",
    "recruiter_education": "Washington College",
    "recruiter_experience": "Senior Recruiter, Customer Engineering at MongoDB",
    "recruiter_tagline": "Senior Recruiter @ MongoDB | Customer Engineering Hiring Expert",
    "recruiter_status": "Current: Senior Recruiter, Customer Engineering at MongoDB",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Carson Stallings",
    "recruiter_location": "Silver Spring, MD",
    "recruiter_linkedin": "https://www.linkedin.com/in/carson-stallings-491532262?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAECBny0B0ssZmsIv7jzhmGUKAPtOLGdj1Dw",
    "recruiter_about": "About: Actalent connects passion with purpose. We’re supporting critical engineering and sciences initiatives that advance how companies serve the world. With almost 40 years of experience, our scalable talent solutions and engineering and sciences services provide the expertise our customers need to achieve more. Actalent’s global footprint and flexible delivery models ensure access to specialized talent where and when you need it.Actalent is an operating company of Allegis Group, the global leader in talent solutions. To learn more, visit actalentservices.com.About: Actalent connects passion with purpose. We’re supporting critical engineering and sciences initiatives that advance how companies serve the world. With almost 40 years of experience, our scalable talent solutions and engineering and sciences services provide the expertise our customers need to achieve more. Actalent’s global footprint and flexible delivery models ensure access to specialized talent where and when you need it.\n\nActalent is an operating company of Allegis Group, the global leader in talent solutions. To learn more, visit actalentservices.com.",
    "recruiter_education": "Phone Etiquette",
    "recruiter_experience": "Recruiter - Civil Engineering at Actalent · Full-time",
    "recruiter_tagline": "Recruiter for Actalent Civil Engineering.",
    "recruiter_status": "Current: Recruiter - Civil Engineering at Actalent",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Kaitlyn Reilly",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/kaitlyn-reilly-90b55948?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAoMUtsB-_P1lv0ZmIDFfiZLlGPF0R6qfQ4",
    "recruiter_about": "Working as a Staff Recruiter, I have the opportunity to recruit and work with top talent across the globe!  I have gained great knowledge by working in agency and corporate full-cycle recruiting within multiple industries including; oil and gas, power, renewable energy, transportation, community development and water resources. Throughout my career, I have led training initiatives, mentored junior recruiters, and changed lives by placing individuals in their dream jobs.Working as a Staff Recruiter, I have the opportunity to recruit and work with top talent across the globe!  I have gained great knowledge by working in agency and corporate full-cycle recruiting within multiple industries including; oil and gas, power, renewable energy, transportation, community development and water resources. Throughout my career, I have led training initiatives, mentored junior recruiters, and changed lives by placing individuals in their dream jobs.",
    "recruiter_education": "Tesla",
    "recruiter_experience": "Staff Recruiter at Tesla",
    "recruiter_tagline": "Staff Recruiter-Mechanical Design Engineering @ Tesla",
    "recruiter_status": "Current: Staff Recruiter at Tesla",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Shubham Singh",
    "recruiter_location": "Frederick, MD",
    "recruiter_linkedin": "https://www.linkedin.com/in/shubham-singh-777082209?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADTeqcsBYNEkgFRxHMTWYwA0LqkuvEPD-Vo",
    "recruiter_about": "Experienced IT and Engineering Recruiter with over 5+ years of experience in talent acquisition, specializing in identifying and hiring top talent in IT and engineering sectors. Adept at building strong relationships with hiring managers and candidates, ensuring a smooth recruitment process from sourcing to onboarding.Experienced IT and Engineering Recruiter with over 5+ years of experience in talent acquisition, specializing in identifying and hiring top talent in IT and engineering sectors. Adept at building strong relationships with hiring managers and candidates, ensuring a smooth recruitment process from sourcing to onboarding.",
    "recruiter_education": "Dr. A.P.J. Abdul Kalam Technical University (AKTU), Lucknow",
    "recruiter_experience": "Senior IT and Engineering Recruiter  at CyberX Info System · Full-time",
    "recruiter_tagline": "Senior IT and Engineering Recruiter",
    "recruiter_status": "Current: Senior IT and Engineering Recruiter at CyberX Info System",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Sam London",
    "recruiter_location": "Baltimore, MD",
    "recruiter_linkedin": "https://www.linkedin.com/in/sam-london-6b5a381a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQRhOkBNXepRPGWvsHRvCOa2kZ88W4UIZQ",
    "recruiter_about": "Give people the power to build community and bring the world closer together. Join Meta and our growing family of apps/services (e.g. Instagram, Oculus, WhatsApp, Messenger, Facebook). We're moving fast, making an impact, and just getting started. Learn more at www.metacareers.com.- Summary -I'm an experienced recruiter focused on end-to-end hiring strategy for leadership and niche positions across a wide variety of subject matter. Throughout my career, I have consistently demonstrated the ability to build relationships with and acquire executive and coveted talent against aggressive timelines.- About my approach - What does it take to be a talent expert in a tight labor market? Constant networking. Referrals. Flexibility. Detailed calibration of open positions and candidates. An obsessive, consultative approach based on business acumen. A passion for helping people. The courage and commitment to exceed high expectations. And, above all else, an innate desire to help prime professionals and organizations rise to the top by developing lasting career matches. I've learned to apply these traits and competencies to my career in order to meet organizational and personal goals, and I continue to seek opportunities to add value and enhance the client and candidate experience I deliver. - Some of my specialties - Executive search, consulting, research and calibration, compensation analysis, talent acquisition, project management, project-based leadership, process improvements, authoring and advertising complex job profiles, recruiting in partnership with senior executives to include C-suite officers, HRIS/HCM/VMS/ATS power user, Boolean expert, basic programming and automation, sales, business development, business/technical writing to include crafting of RFPs, relationship management, writing and editing at an advanced level, building style guides, presentation development/oration, qualification, targeting, positioning, training, communication, data analysis and reporting, presenting complex ideas to a wide audience.Give people the power to build community and bring the world closer together. Join Meta and our growing family of apps/services (e.g. Instagram, Oculus, WhatsApp, Messenger, Facebook). We're moving fast, making an impact, and just getting started. Learn more at www.metacareers.com.\n\n- Summary -\n\nI'm an experienced recruiter focused on end-to-end hiring strategy for leadership and niche positions across a wide variety of subject matter. Throughout my career, I have consistently demonstrated the ability to build relationships with and acquire executive and coveted talent against aggressive timelines.\n\n- About my approach - \n\nWhat does it take to be a talent expert in a tight labor market? Constant networking. Referrals. Flexibility. Detailed calibration of open positions and candidates. An obsessive, consultative approach based on business acumen. A passion for helping people. The courage and commitment to exceed high expectations. And, above all else, an innate desire to help prime professionals and organizations rise to the top by developing lasting career matches. I've learned to apply these traits and competencies to my career in order to meet organizational and personal goals, and I continue to seek opportunities to add value and enhance the client and candidate experience I deliver. \n\n- Some of my specialties - \n\nExecutive search, consulting, research and calibration, compensation analysis, talent acquisition, project management, project-based leadership, process improvements, authoring and advertising complex job profiles, recruiting in partnership with senior executives to include C-suite officers, HRIS/HCM/VMS/ATS power user, Boolean expert, basic programming and automation, sales, business development, business/technical writing to include crafting of RFPs, relationship management, writing and editing at an advanced level, building style guides, presentation development/oration, qualification, targeting, positioning, training, communication, data analysis and reporting, presenting complex ideas to a wide audience.",
    "recruiter_education": "University of Maryland - Robert H. Smith School of Business",
    "recruiter_experience": "Executive Recruiter | Engineering, Product, UX, Data & Operations  at Meta",
    "recruiter_tagline": "Executive Recruiting @ Meta | Agile Recruiting Strategy | 🎶",
    "recruiter_status": "Current: Executive Recruiter | Engineering, Product, UX, Data & Operations",
    "search_query": "Network Engineering"
  },
  {
    "recruiter_name": "Dhanu Shree",
    "recruiter_location": "Edison, NJ",
    "recruiter_linkedin": "https://www.linkedin.com/in/dhanu-shree-15b36a202?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADOqrlcBdxEKj0RpAxZPIN4pcBAbzcesLIw",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Recruiter at Sunrise Systems, Inc. · Full-time",
    "recruiter_tagline": "Recruiter at Sunrise Systems, Inc.",
    "recruiter_status": "Current: Recruiter at Sunrise Systems, Inc. - Sunrise Systems is a certified diversity business (MBE) has over three decades of delivering...",
    "search_query": "Systems Administration"
  },
  {
    "recruiter_name": "Yasmin Popal",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/yasmin-popal?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADPG8yUBkcVH4V8b7BZaK8qeNbCnkJWEB7s",
    "recruiter_about": "​​​​​​​Apex Systems is a world class technology services business that incorporates industry insights and experience to deliver solutions that fulfill our clients’ digital visions. We provide a continuum of service from workforce mobilization and modern enterprise solutions to digital innovation to drive better results and bring more value to our clients. Apex transforms our customers with modern enterprise solutions tailored to the industries we serve. Apex has a presence in over 70 markets across the US, Canada, and Mexico. Apex is a segment of ASGN Inc. (NYSE: ASGN). To learn more, visit www.apexsystems.com.​​​​​​​Apex Systems is a world class technology services business that incorporates industry insights and experience to deliver solutions that fulfill our clients’ digital visions. We provide a continuum of service from workforce mobilization and modern enterprise solutions to digital innovation to drive better results and bring more value to our clients. Apex transforms our customers with modern enterprise solutions tailored to the industries we serve. Apex has a presence in over 70 markets across the US, Canada, and Mexico. Apex is a segment of ASGN Inc. (NYSE: ASGN). To learn more, visit www.apexsystems.com.",
    "recruiter_education": "Apex Systems",
    "recruiter_experience": "Professional Recruiter at Apex Systems",
    "recruiter_tagline": "Professional Recruiter – Government Services at Apex Systems",
    "recruiter_status": "Current: Professional Recruiter at Apex Systems",
    "search_query": "Systems Administration"
  },
  {
    "recruiter_name": "Vik Amiet",
    "recruiter_location": "Valley Stream, NY",
    "recruiter_linkedin": "https://www.linkedin.com/in/vik-amiet-8b8414281?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAESVMQwBHKVDagGPVJX9Tln8d3zjL8tluhE",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Recruiter at ARIES AERO SYSTEMS",
    "recruiter_tagline": "Recruiter at VR Staffing Solutions",
    "recruiter_status": "Current: Recruiter at ARIES AERO SYSTEMS",
    "search_query": "Systems Administration"
  },
  {
    "recruiter_name": "Bohn Gehyeka",
    "recruiter_location": "Philadelphia, PA",
    "recruiter_linkedin": "https://www.linkedin.com/in/bohn-gehyeka-427284127?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAB8vrV8B_dJQjzWWnt_2QqO0uWBVka1X98M",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Campus Recruiter at McKinsey & Company",
    "recruiter_tagline": "Senior Recruiter at McKinsey",
    "recruiter_status": "Current: Campus Recruiter at McKinsey & Company",
    "search_query": "Systems Administration"
  },
  {
    "recruiter_name": "Nishant Aggarwal",
    "recruiter_location": "Sterling, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/nishant-aggarwal-71a8a2163?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACcby4YBDS9n7GPjshNivLIysvfrmZLrvV4",
    "recruiter_about": "Hard-working and committed, entry-level recruiter seeking to combine advanced coursework and hands-on experience in human resources into a challenging career solving practical staffing problems within an organization in need of talented and motivated employment teams.Hard-working and committed, entry-level recruiter seeking to combine advanced coursework and hands-on experience in human resources into a challenging career solving practical staffing problems within an organization in need of talented and motivated employment teams.",
    "recruiter_education": "Kurukshetra University",
    "recruiter_experience": "Recruiter at Extend Information Systems Inc. · Full-time",
    "recruiter_tagline": "Recruiter at Extend Information Systems",
    "recruiter_status": "Current: Recruiter at Extend Information Systems Inc.",
    "search_query": "Systems Administration"
  },
  {
    "recruiter_name": "Alyssa Williamson",
    "recruiter_location": "Boston, MA",
    "recruiter_linkedin": "https://www.linkedin.com/in/alyssa-williamson-2bb4a423b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADux5q8BHHA5e8elo3SapVFhEpF6LFZrkWE",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Recruiter at Medix™ · Full-time",
    "recruiter_tagline": "Healthcare Recruiter",
    "recruiter_status": "Current: Recruiter at Medix™",
    "search_query": "Database Administration"
  },
  {
    "recruiter_name": "Christopher Jack",
    "recruiter_location": "United States",
    "recruiter_linkedin": "https://www.linkedin.com/in/christopher-jack-761a0122b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADmisvkBuhbSK-wCl_dvXc97UGamo_iWleQ",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Recruiter at Zoox · Full-time",
    "recruiter_tagline": "Senior recruiter at Zoox",
    "recruiter_status": "Current: Recruiter at Zoox",
    "search_query": "Database Administration"
  },
  {
    "recruiter_name": "Shareen Banerjee",
    "recruiter_location": "Alpharetta, GA",
    "recruiter_linkedin": "https://www.linkedin.com/in/shareen-banerjee-4b7987152?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACTOxgsBUgNWrzQP5V3y7rc6JnDkfvbZwjc",
    "recruiter_about": "I am a dedicated and meticulous person who constantly seeks to implement fresh ideas using a range of enthusiastic, inventive, and creative methods both in my professional role and in my personal life.• Currently employed as a Technical Recruiter at ASK Consulting.• Previously worked as a NON-IT Recruiter at SPECTRAFORCE Technologies in Mohali.• Prior experience as a Recruitment Associate at Lido Learning in Noida.I am a committed team player who places great emphasis on collaboration, a positive mindset, and self-driven motivation. I eagerly anticipate challenging opportunities that facilitate my acquisition of new skills.I am a dedicated and meticulous person who constantly seeks to implement fresh ideas using a range of enthusiastic, inventive, and creative methods both in my professional role and in my personal life.\n\n• Currently employed as a Technical Recruiter at ASK Consulting.\n\n• Previously worked as a NON-IT Recruiter at SPECTRAFORCE Technologies in Mohali.\n\n• Prior experience as a Recruitment Associate at Lido Learning in Noida.\n\nI am a committed team player who places great emphasis on collaboration, a positive mindset, and self-driven motivation. I eagerly anticipate challenging opportunities that facilitate my acquisition of new skills.",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter at ASK Consulting · Full-time",
    "recruiter_tagline": "Passionate Recruiter | Connecting Top Talent with Exceptional Opportunities",
    "recruiter_status": "Current: Technical Recruiter at ASK Consulting",
    "search_query": "Database Administration"
  },
  {
    "recruiter_name": "Aaron Matthias",
    "recruiter_location": "Washington, DC",
    "recruiter_linkedin": "https://www.linkedin.com/in/aaronmatthias?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA-VE70BbEZ04NHSkwtJwz9-YH7T9Sox1LM",
    "recruiter_about": "Who am I?I'm a husband, doodle dad, sneaker-head, gym-goer, and a cheesy joke maker - Raise your hand if you love mozzarella! I digress. By trade, I'm a Senior Recruiter with agency and internal corporate experience hiring technical talent in cloud information technology and government services. My superpowers include: curious learner, initiative taker, trust earner, public speaker, client relationship management, understanding needs, showcasing value, training & mentoring, identifying gaps and developing solutions.I'm always open to connecting with colleagues to use my superpowers! Areas of interest are Lead Recruiter, Recruiting Manager, Client Engagement, and/or non-recruiting roles where my skills are transferable. Cheers!Who am I?\nI'm a husband, doodle dad, sneaker-head, gym-goer, and a cheesy joke maker - Raise your hand if you love mozzarella! I digress.\n \nBy trade, I'm a Senior Recruiter with agency and internal corporate experience hiring technical talent in cloud information technology and government services. My superpowers include: curious learner, initiative taker, trust earner, public speaker, client relationship management, understanding needs, showcasing value, training & mentoring, identifying gaps and developing solutions.\n\nI'm always open to connecting with colleagues to use my superpowers! Areas of interest are Lead Recruiter, Recruiting Manager, Client Engagement, and/or non-recruiting roles where my skills are transferable. \n\nCheers!",
    "recruiter_education": "Stetson University",
    "recruiter_experience": "Full Lifecycle Recruiter - AWS Utility Cloud Computing at Amazon Web Services (AWS)",
    "recruiter_tagline": "Talent Acquisition @ Amazon AWS | Cloud Computing | AWS Certified Cloud Practitioner",
    "recruiter_status": "Current: Full Lifecycle Recruiter - AWS Utility Cloud Computing at Amazon Web Services (AWS)",
    "search_query": "Cloud Computing"
  },
  {
    "recruiter_name": "David Fitzpatrick",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/david-fitzpatrick-3b0401205?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADQ1CPQBKxAm9jvx66US8wANnxHR_py6cIs",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Sourcing Recruiter at Amazon Web Services (AWS) · Full-time",
    "recruiter_tagline": "Technical Sourcing Recruiter at Amazon Web Services - Amazon Dedicated Cloud",
    "recruiter_status": "Current: Technical Sourcing Recruiter at Amazon Web Services (AWS)",
    "search_query": "Cloud Computing"
  },
  {
    "recruiter_name": "Ryan Hutchins",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/ryan-hutchins-88639382?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABF_diYBGzufG_HFG2JDTXHbMih3BN9jyXI",
    "recruiter_about": "10+ years of recruiting experience, with a focus on federal, IT, and Healthcare.  Experience recruiting for DoD, IC, HHS, DoC, DoEd, and DoE programs.  Excel in Data, Cloud, and Software related roles, with experience as well with Logistics, Healthcare, and Science.  Living in the Northern VA area, wife and kid on the way.  Strive to do the best I can for all of my candidates...dont under sell yourself, know your worth!10+ years of recruiting experience, with a focus on federal, IT, and Healthcare.  Experience recruiting for DoD, IC, HHS, DoC, DoEd, and DoE programs.  Excel in Data, Cloud, and Software related roles, with experience as well with Logistics, Healthcare, and Science.  Living in the Northern VA area, wife and kid on the way.  Strive to do the best I can for all of my candidates...dont under sell yourself, know your worth!",
    "recruiter_education": "undefined",
    "recruiter_experience": "Senior Technical Recruiter at M9 Solutions · Full-time",
    "recruiter_tagline": "Senior Technical Recruiter specializing in Cybersecurity and Cloud computing at M9 Solutions",
    "recruiter_status": "Current: Senior Technical Recruiter at M9 Solutions",
    "search_query": "Cloud Computing"
  },
  {
    "recruiter_name": "Chris Kim",
    "recruiter_location": "Washington DC-Baltimore Area",
    "recruiter_linkedin": "https://www.linkedin.com/in/chris-kim-984a03107?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABsGAbQB4fkPmYRnnZAh_SxLQBdVCJ5ibPI",
    "recruiter_about": "undefined",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter, Google Cloud at Google · Full-time",
    "recruiter_tagline": "Technical Recruiter, Google Cloud",
    "recruiter_status": "Current: Technical Recruiter, Google Cloud at Google",
    "search_query": "Cloud Computing"
  },
  {
    "recruiter_name": "Fenil Patel",
    "recruiter_location": "Herndon, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/fenil-patel-6827a7213?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADYLYQIBGERERpAzUOntQ0j8D16_GgWSLwo",
    "recruiter_about": "undefined",
    "recruiter_education": "Interviewing",
    "recruiter_experience": "Recruiter at LanceSoft, Inc. · Full-time",
    "recruiter_tagline": "Senior Recruiter at LanceSoft, Inc. (Fullstack | .Net | Software developer | Cloud | Devops | Data) BFSI",
    "recruiter_status": "Current: Recruiter at LanceSoft, Inc.",
    "search_query": "DevOps"
  },
  {
    "recruiter_name": "Punam Mhetre",
    "recruiter_location": "McLean, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/punam-mhetre?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAADdyZqIBCGUPXRpyZbFbtNrNac1pwxvHuyg",
    "recruiter_about": "Technical Recruiter at Dexian, specializing in recruitment for Fortune 500 companies in the United States with a focus on sourcing top talent across industries.Leveraging my software development background in C# .NET MVC, Web API, and MySQL, I bring a unique technical perspective to understanding and fulfilling client needs.Full Stack Java Development and Azure DevOps certification further enhance my ability to recruit for specialized roles.Known for my strong communication skills, I bridge the gap between technical requirements and talent acquisition seamlessly.Technical Recruiter at Dexian, specializing in recruitment for Fortune 500 companies in the United States with a focus on sourcing top talent across industries.\n\nLeveraging my software development background in C# .NET MVC, Web API, and MySQL, I bring a unique technical perspective to understanding and fulfilling client needs.\n\nFull Stack Java Development and Azure DevOps certification further enhance my ability to recruit for specialized roles.\n\nKnown for my strong communication skills, I bridge the gap between technical requirements and talent acquisition seamlessly.",
    "recruiter_education": "undefined",
    "recruiter_experience": "Technical Recruiter at Dexian · Full-time",
    "recruiter_tagline": "Technical Recruiter at Dexian | Software Developer | .Net | MVC | Web Api | SQL | Azure | Devops",
    "recruiter_status": "Current: Technical Recruiter at Dexian",
    "search_query": "DevOps"
  },
  {
    "recruiter_name": "Jessica Nguyen",
    "recruiter_location": "Washington, DC",
    "recruiter_linkedin": "https://www.linkedin.com/in/jnguyenrecruit?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAEflicABu9Zzuwr9PPfTltLt_4JRapw1Zsw",
    "recruiter_about": "Healthcare recruiter helping people find jobs that fit their lifestyles and career studies. Newly on Linkedin, please feel free to connect and reach out whenever needed. Hiring across the U.S.Healthcare recruiter helping people find jobs that fit their lifestyles and career studies. Newly on Linkedin, please feel free to connect and reach out whenever needed. Hiring across the U.S.",
    "recruiter_education": "Arizona State University",
    "recruiter_experience": "Healthcare Recruiter at erp international recruiter · Part-time",
    "recruiter_tagline": "Healthcare Recruiter",
    "recruiter_status": "Current: Healthcare Recruiter at erp international recruiter",
    "search_query": "DevOps"
  },
  {
    "recruiter_name": "Linzie Blythe",
    "recruiter_location": "Arlington, VA",
    "recruiter_linkedin": "https://www.linkedin.com/in/linzieblythe?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAL5n3YBpkF9KhAUz-_i2Fh3qt-YUdroxr4",
    "recruiter_about": "Technical Recruiter with experience recruiting both cleared and uncleared professionals within IT, Space/Intel, and Litigation Support government contracts.Technical Recruiter with experience recruiting both cleared and uncleared professionals within IT, Space/Intel, and Litigation Support government contracts.",
    "recruiter_education": "Penn State University",
    "recruiter_experience": "Technical Recruiter III at Peraton · Full-time",
    "recruiter_tagline": "Technical Recruiter at Peraton",
    "recruiter_status": "Current: Technical Recruiter III at Peraton",
    "search_query": "DevOps"
  }
]